# Задание №1

name = input('Введите имя')
age = int(input('Введите возраст'))
print(f'Ваше имя{name}, Ваш возраст {age}')