# Задание №1

division = lambda x = int(input('Введите делимое')), y = int(input('Введите делитель')): x / y if y != 0 else print('Деление на ноль')
print(division())