# Задание №3

n = int(input('Введите число'))
nn = n * 11
nnn = n * 111
print(n + nn + nnn)
