# Задание №4

for ind, el in enumerate(input('Введите сообщение').split(' '), 1):
    print(ind, el[:10])