# Задание №4

number = int(input('Введите целое положительное число'))
n = 0

while n < number:
    n += 1
print(f'Самая большая цифра в числе = {n}')