# Задание №6&7

int_func = lambda message=input('Введите слова: '): message.title()
print(int_func())